janhavelka/ESP32_Interfaces/lib/RuntimeProbe/src/RuntimeProbe.cpp
#include "RuntimeProbe.h"

#include <ctype.h>
#include <string.h>
#include <Wire.h>
#include <SPI.h>
#include "soc/soc_caps.h"

static const size_t kMaxIoBytes = 128;

static void printHexLine(const char *prefix, const uint8_t *data, size_t len) {
  Serial.print(prefix);
  for (size_t i = 0; i < len; ++i) {
    Serial.printf(" %02X", data[i]);
  }
  Serial.println();
}

RuntimeProbe::PinRegistry::PinRegistry() { clear(); }

void RuntimeProbe::PinRegistry::clear() {
  for (int i = 0; i < kMaxPins; ++i) {
    entries_[i].claimed = false;
    entries_[i].purpose[0] = '\0';
  }
}

bool RuntimeProbe::PinRegistry::isTracked(int pin) const { return pin >= 0 && pin < kMaxPins; }

bool RuntimeProbe::PinRegistry::isClaimed(int pin) const {
  if (!isTracked(pin)) {
    return false;
  }
  return entries_[pin].claimed;
}

const char *RuntimeProbe::PinRegistry::purpose(int pin) const {
  if (!isTracked(pin) || !entries_[pin].claimed) {
    return "";
  }
  return entries_[pin].purpose;
}

bool RuntimeProbe::PinRegistry::claim(int pin, const char *purpose, char *err, size_t errLen) {
  if (!isTracked(pin)) {
    snprintf(err, errLen, "pin %d out of tracked range (0-%d)", pin, kMaxPins - 1);
    return false;
  }
  if (entries_[pin].claimed) {
    snprintf(err, errLen, "pin %d already claimed (%s)", pin, entries_[pin].purpose);
    return false;
  }
  entries_[pin].claimed = true;
  strncpy(entries_[pin].purpose, purpose, sizeof(entries_[pin].purpose) - 1);
  entries_[pin].purpose[sizeof(entries_[pin].purpose) - 1] = '\0';
  return true;
}

void RuntimeProbe::PinRegistry::release(int pin, bool setInput) {
  if (!isTracked(pin)) {
    return;
  }
  if (setInput) {
    pinMode(pin, INPUT);
  }
  entries_[pin].claimed = false;
  entries_[pin].purpose[0] = '\0';
}

void RuntimeProbe::PinRegistry::releaseAll(bool setInput) {
  for (int i = 0; i < kMaxPins; ++i) {
    if (!entries_[i].claimed) {
      continue;
    }
    if (setInput) {
      pinMode(i, INPUT);
    }
    entries_[i].claimed = false;
    entries_[i].purpose[0] = '\0';
  }
}

void RuntimeProbe::PinRegistry::printClaims() const {
  bool any = false;
  for (int i = 0; i < kMaxPins; ++i) {
    if (!entries_[i].claimed) {
      continue;
    }
    Serial.printf("  pin %d -> %s\n", i, entries_[i].purpose);
    any = true;
  }
  if (!any) {
    Serial.println("  (none)");
  }
}

const char *RuntimeProbe::modeToString(Mode mode) const {
  switch (mode) {
    case Mode::Off:
      return "off";
    case Mode::Gpio:
      return "gpio";
    case Mode::Uart:
      return "uart";
    case Mode::Jtag:
      return "jtag";
    case Mode::Spi:
      return "spi";
    case Mode::I2c:
      return "i2c";
    case Mode::Pwm:
      return "pwm";
  }
  return "unknown";
}

bool RuntimeProbe::validatePin(int pin, char *err, size_t errLen) const {
  if (pin < 0) {
    snprintf(err, errLen, "pin must be >= 0");
    return false;
  }
  if (pin >= PinRegistry::kMaxPins) {
    snprintf(err, errLen, "pin %d too large for registry", pin);
    return false;
  }
  if (pin > 48) {
    Serial.printf("WARN: pin %d is outside typical ESP32-S2/S3 range (0..48).\n", pin);
  }
  return true;
}

bool RuntimeProbe::parseInt(const char *s, int *out) const {
  if (!s || !*s) {
    return false;
  }
  char *end = nullptr;
  long val = strtol(s, &end, 0);
  if (!end || *end != '\0') {
    return false;
  }
  *out = static_cast<int>(val);
  return true;
}

bool RuntimeProbe::parseUint32(const char *s, uint32_t *out) const {
  if (!s || !*s) {
    return false;
  }
  char *end = nullptr;
  unsigned long val = strtoul(s, &end, 0);
  if (!end || *end != '\0') {
    return false;
  }
  *out = static_cast<uint32_t>(val);
  return true;
}

bool RuntimeProbe::parseByte(const char *s, uint8_t *out, char *err, size_t errLen) const {
  if (!s || !*s) {
    snprintf(err, errLen, "missing byte");
    return false;
  }
  char *end = nullptr;
  unsigned long val = strtoul(s, &end, 0);
  if (!end || *end != '\0') {
    snprintf(err, errLen, "invalid byte");
    return false;
  }
  if (val > 0xFF) {
    snprintf(err, errLen, "byte out of range");
    return false;
  }
  *out = static_cast<uint8_t>(val);
  return true;
}

bool RuntimeProbe::parseI2cAddress(const char *s, uint8_t *out, char *err, size_t errLen) const {
  if (!s || !*s) {
    snprintf(err, errLen, "missing i2c address");
    return false;
  }
  char *end = nullptr;
  unsigned long val = strtoul(s, &end, 0);
  if (!end || *end != '\0') {
    snprintf(err, errLen, "invalid i2c address");
    return false;
  }
  if (val > 0x7F) {
    snprintf(err, errLen, "i2c address out of range (0x00-0x7F)");
    return false;
  }
  *out = static_cast<uint8_t>(val);
  return true;
}

void RuntimeProbe::gpioReleasePin() {
  if (!gpio_.pinClaimed || gpio_.pin < 0) {
    gpio_.wave = GpioState::None;
    return;
  }
  if (gpio_.safe == GpioState::SafeInput) {
    pins_.release(gpio_.pin, true);
  } else {
    pinMode(gpio_.pin, OUTPUT);
    digitalWrite(gpio_.pin, gpio_.safe == GpioState::SafeHigh ? HIGH : LOW);
    pins_.release(gpio_.pin, false);
  }
  gpio_.pinClaimed = false;
  gpio_.wave = GpioState::None;
}

bool RuntimeProbe::gpioEnsureClaimed(char *err, size_t errLen) {
  if (gpio_.pin < 0) {
    snprintf(err, errLen, "gpio pin not set");
    return false;
  }
  if (!gpio_.pinClaimed) {
    if (!pins_.claim(gpio_.pin, "GPIO", err, errLen)) {
      return false;
    }
    gpio_.pinClaimed = true;
  }
  return true;
}

void RuntimeProbe::gpioUpdate() {
  if (gpio_.wave == GpioState::None || !gpio_.pinClaimed) {
    return;
  }
  const uint32_t now = micros();
  if (gpio_.wave == GpioState::Toggle) {
    if (static_cast<int32_t>(now - gpio_.nextEdgeUs) >= 0) {
      gpio_.level = !gpio_.level;
      digitalWrite(gpio_.pin, gpio_.level ? HIGH : LOW);
      gpio_.nextEdgeUs = now + gpio_.halfPeriodUs;
    }
    return;
  }
  if (gpio_.wave == GpioState::Pulse) {
    if (static_cast<int32_t>(now - gpio_.nextEdgeUs) >= 0) {
      gpio_.level = !gpio_.level;
      digitalWrite(gpio_.pin, gpio_.level ? HIGH : LOW);
      if (gpio_.level) {
        gpio_.nextEdgeUs = now + gpio_.pulseWidthUs;
      } else {
        gpio_.nextEdgeUs = now + (gpio_.pulsePeriodUs - gpio_.pulseWidthUs);
      }
    }
  }
}

HardwareSerial *RuntimeProbe::uartByNum(uint8_t num) {
  if (num == 0) {
#if defined(ARDUINO_USB_CDC_ON_BOOT) && ARDUINO_USB_CDC_ON_BOOT
    return &Serial0;
#else
    return &Serial;
#endif
  }
#if SOC_UART_NUM > 1
  if (num == 1) {
    return &Serial1;
  }
#endif
#if SOC_UART_NUM > 2
  if (num == 2) {
    return &Serial2;
  }
#endif
  return nullptr;
}

const char *RuntimeProbe::uartPatternName(UartState::Pattern pat) const {
  switch (pat) {
    case UartState::Pat55:
      return "55";
    case UartState::PatAA:
      return "aa";
    case UartState::PatRamp:
      return "ramp";
    case UartState::PatAscii:
      return "ascii";
  }
  return "unknown";
}

