janhavelka/ESP32_Interfaces/lib/RuntimeProbe/src/RuntimeProbe.cpp
uint8_t RuntimeProbe::uartNextByte() {
  switch (uart_.pattern) {
    case UartState::Pat55:
      return 0x55;
    case UartState::PatAA:
      return 0xAA;
    case UartState::PatRamp: {
      uint8_t val = uart_.rampValue;
      uart_.rampValue++;
      return val;
    }
    case UartState::PatAscii: {
      static const char kAscii[] = "ESP32 UART TEST\r\n";
      uint8_t val = static_cast<uint8_t>(kAscii[uart_.asciiIndex]);
      uart_.asciiIndex = (uart_.asciiIndex + 1) % (sizeof(kAscii) - 1);
      return val;
    }
  }
  return 0x00;
}

void RuntimeProbe::uartSendBytes(size_t count) {
  if (!uart_.port || count == 0) {
    return;
  }
  for (size_t i = 0; i < count; ++i) {
    uart_.port->write(uartNextByte());
  }
}

void RuntimeProbe::uartStop() {
  if (!uart_.active) {
    return;
  }
  if (uart_.port) {
    uart_.port->end();
  }
  if (uart_.txPin >= 0) {
    pins_.release(uart_.txPin, true);
  }
  if (uart_.rxPin >= 0) {
    pins_.release(uart_.rxPin, true);
  }
  uart_.active = false;
  uart_.port = nullptr;
  uart_.txPin = -1;
  uart_.rxPin = -1;
}

void RuntimeProbe::uartUpdate() {
  if (!uart_.active || !uart_.port) {
    return;
  }

  const uint32_t now = micros();
  if (uart_.txRateBps > 0) {
    const uint32_t elapsed = now - uart_.lastMicros;
    uart_.lastMicros = now;
    uart_.txBudget += static_cast<uint64_t>(elapsed) * uart_.txRateBps;
    size_t allowed = static_cast<size_t>(uart_.txBudget / 1000000ULL);
    size_t space = uart_.port->availableForWrite();
    size_t toSend = (allowed < space) ? allowed : space;
    if (toSend > 0) {
      uartSendBytes(toSend);
      uart_.txBudget -= static_cast<uint64_t>(toSend) * 1000000ULL;
    }
  } else {
    size_t space = uart_.port->availableForWrite();
    if (space > 0) {
      uartSendBytes(space);
    }
  }

  if (uart_.echo) {
    while (uart_.port->available()) {
      Serial.write(uart_.port->read());
    }
  } else {
    while (uart_.port->available()) {
      uart_.port->read();
      uart_.rxCount++;
    }
    uint32_t nowMs = millis();
    if (uart_.rxCount > 0 && (nowMs - uart_.lastRxReportMs) > 1000) {
      Serial.printf("UART RX: %u bytes\n", uart_.rxCount);
      uart_.rxCount = 0;
      uart_.lastRxReportMs = nowMs;
    }
  }
}

void RuntimeProbe::jtagSetDefaultSeq() {
  jtag_.seqLen = 8;
  for (size_t i = 0; i < jtag_.seqLen; ++i) {
    jtag_.tmsSeq[i] = (i % 2) ? 1 : 0;
    jtag_.tdiSeq[i] = (i / 2) % 2 ? 1 : 0;
  }
  jtag_.seqIndex = 0;
}

void RuntimeProbe::jtagApplySeq() {
  if (jtag_.seqLen == 0) {
    return;
  }
  digitalWrite(jtag_.tmsPin, jtag_.tmsSeq[jtag_.seqIndex] ? HIGH : LOW);
  digitalWrite(jtag_.tdiPin, jtag_.tdiSeq[jtag_.seqIndex] ? HIGH : LOW);
}

void RuntimeProbe::jtagStop() {
  if (!jtag_.active) {
    return;
  }
  pins_.release(jtag_.tckPin, true);
  pins_.release(jtag_.tmsPin, true);
  pins_.release(jtag_.tdiPin, true);
  if (jtag_.tdoPin >= 0) {
    pins_.release(jtag_.tdoPin, true);
  }
  jtag_.active = false;
  jtag_.tckPin = -1;
  jtag_.tmsPin = -1;
  jtag_.tdiPin = -1;
  jtag_.tdoPin = -1;
}

void RuntimeProbe::jtagUpdate() {
  if (!jtag_.active || jtag_.halfPeriodUs == 0) {
    return;
  }
  const uint32_t now = micros();
  if (static_cast<int32_t>(now - jtag_.nextEdgeUs) < 0) {
    return;
  }
  jtag_.nextEdgeUs = now + jtag_.halfPeriodUs;
  if (jtag_.tckHigh) {
    jtag_.tckHigh = false;
    digitalWrite(jtag_.tckPin, LOW);
    jtag_.seqIndex = (jtag_.seqIndex + 1) % jtag_.seqLen;
    jtagApplySeq();
  } else {
    jtag_.tckHigh = true;
    digitalWrite(jtag_.tckPin, HIGH);
    if (jtag_.tdoPin >= 0) {
      uint8_t bit = digitalRead(jtag_.tdoPin) ? 1 : 0;
      jtag_.tdoShift = (jtag_.tdoShift << 1) | bit;
      jtag_.tdoCount++;
      if (jtag_.tdoCount >= 64) {
        Serial.printf("TDO 0x%016llX\n", static_cast<unsigned long long>(jtag_.tdoShift));
        jtag_.tdoShift = 0;
        jtag_.tdoCount = 0;
      }
    }
  }
}

void RuntimeProbe::i2cStop() {
  if (!i2c_.active) {
    return;
  }
  Wire.end();
  if (i2c_.sdaPin >= 0) {
    pins_.release(i2c_.sdaPin, true);
  }
  if (i2c_.sclPin >= 0) {
    pins_.release(i2c_.sclPin, true);
  }
  i2c_.active = false;
  i2c_.scanActive = false;
  i2c_.sdaPin = -1;
  i2c_.sclPin = -1;
}

void RuntimeProbe::i2cUpdate() {
  if (!i2c_.active || !i2c_.scanActive) {
    return;
  }
  const uint32_t nowMs = millis();
  if (static_cast<int32_t>(nowMs - i2c_.scanNextMs) < 0) {
    return;
  }
  if (i2c_.scanAddr > i2c_.scanEnd) {
    Serial.printf("I2C scan done, found %u device(s)\n", i2c_.scanFound);
    i2c_.scanActive = false;
    return;
  }
  uint8_t addr = i2c_.scanAddr++;
  Wire.beginTransmission(addr);
  uint8_t err = Wire.endTransmission();
  if (err == 0) {
    Serial.printf("I2C found 0x%02X\n", addr);
    i2c_.scanFound++;
  }
  i2c_.scanNextMs = nowMs + 2;
}

void RuntimeProbe::spiStop() {
  if (!spi_.active) {
    return;
  }
  SPI.end();
  if (spi_.sckPin >= 0) {
    pins_.release(spi_.sckPin, true);
  }
  if (spi_.misoPin >= 0) {
    pins_.release(spi_.misoPin, true);
  }
  if (spi_.mosiPin >= 0) {
    pins_.release(spi_.mosiPin, true);
  }
  if (spi_.csPin >= 0) {
    pins_.release(spi_.csPin, true);
  }
  spi_.active = false;
  spi_.sckPin = -1;
  spi_.misoPin = -1;
  spi_.mosiPin = -1;
  spi_.csPin = -1;
}

void RuntimeProbe::stopAllModes() {
  gpioReleasePin();
  uartStop();
  jtagStop();
  i2cStop();
  spiStop();
}

int RuntimeProbe::tokenize(char *line, char *argv[], int maxTokens) const {
  int argc = 0;
  char *p = line;
  while (*p && argc < maxTokens) {
    while (*p && isspace(static_cast<unsigned char>(*p))) {
      ++p;
    }
    if (!*p) {
      break;
    }
    if (*p == '"') {
      ++p;
      argv[argc++] = p;
      while (*p && *p != '"') {
        ++p;
      }
      if (*p == '"') {
        *p = '\0';
        ++p;
      }
    } else {
      argv[argc++] = p;
      while (*p && !isspace(static_cast<unsigned char>(*p))) {
        ++p;
      }
      if (*p) {
        *p = '\0';
        ++p;
      }
    }
  }
  return argc;
}

void RuntimeProbe::printHelp() const {
  Serial.println("Commands:");
  Serial.println("  help");
  Serial.println("  status");
  Serial.println("  pins");
  Serial.println("  mode off|gpio|uart|jtag|spi|i2c|pwm");
  Serial.println("  gpio set <pin>");
  Serial.println("  gpio toggle <freq_hz>");
  Serial.println("  gpio pulse <width_us> <period_us>");
  Serial.println("  gpio high|low");
  Serial.println("  gpio safe <0|1|input>");
  Serial.println("  gpio stop");
  Serial.println("  uart force <0|1>");
  Serial.println("  uart start <num> <tx_pin> <rx_pin> <baud>");
  Serial.println("  uart pattern 55|aa|ramp|ascii");
  Serial.println("  uart txrate <bytes_per_sec>");
  Serial.println("  uart echo <0|1>");
  Serial.println("  uart stop");
  Serial.println("  jtag bitbang <tck> <tms> <tdi> [tdo] <freq_hz>");
  Serial.println("  jtag seq <bits_or_hex>  (pairs: TMS then TDI)");
  Serial.println("  jtag stop");
  Serial.println("  i2c start <sda> <scl> [freq_hz] [timeout_ms]");
  Serial.println("  i2c freq <hz>");
  Serial.println("  i2c timeout <ms>");
  Serial.println("  i2c scan [start] [end] | stop");
  Serial.println("  i2c write <addr> <byte...>");
  Serial.println("  i2c read <addr> <len>");
  Serial.println("  i2c writeread <addr> <len> <byte...>");
  Serial.println("  i2c stop");
  Serial.println("  spi start <sck> <miso> <mosi> [cs]");
  Serial.println("  spi freq <hz>");
  Serial.println("  spi mode <0|1|2|3>");
  Serial.println("  spi order msb|lsb");
  Serial.println("  spi cs <pin|-1>");
  Serial.println("  spi dummy <byte>");
  Serial.println("  spi xfer <byte...>");
  Serial.println("  spi read <len>");
  Serial.println("  spi stop");
}

void RuntimeProbe::printStatus() const {
  Serial.printf("Mode: %s\n", modeToString(mode_));
  Serial.printf("GPIO: pin=%d claimed=%s wave=%s safe=%s\n",
                gpio_.pin,
                gpio_.pinClaimed ? "yes" : "no",
                gpio_.wave == GpioState::None
                    ? "none"
                    : (gpio_.wave == GpioState::Toggle
                           ? "toggle"
                           : (gpio_.wave == GpioState::Pulse ? "pulse" : "static")),
                gpio_.safe == GpioState::SafeInput
                    ? "input"
                    : (gpio_.safe == GpioState::SafeHigh ? "high" : "low"));
  if (uart_.active) {
    Serial.printf("UART: num=%u tx=%d rx=%d baud=%u pattern=%s txrate=%u echo=%s\n",
                  uart_.num,
                  uart_.txPin,
                  uart_.rxPin,
                  uart_.baud,
                  uartPatternName(uart_.pattern),
                  uart_.txRateBps,
                  uart_.echo ? "on" : "off");
  } else {
    Serial.println("UART: inactive");
  }
  if (jtag_.active) {
    Serial.printf("JTAG: tck=%d tms=%d tdi=%d tdo=%d freq=%u seqLen=%u\n",
                  jtag_.tckPin,
                  jtag_.tmsPin,
                  jtag_.tdiPin,
                  jtag_.tdoPin,
                  jtag_.freqHz,
                  static_cast<unsigned>(jtag_.seqLen));
  } else {
    Serial.println("JTAG: inactive");
  }
  if (i2c_.active) {
    Serial.printf("I2C: sda=%d scl=%d freq=%u timeout=%u scan=%s\n",
                  i2c_.sdaPin,
                  i2c_.sclPin,
                  i2c_.freqHz,
                  i2c_.timeoutMs,
                  i2c_.scanActive ? "on" : "off");
  } else {
    Serial.println("I2C: inactive");
  }
  if (spi_.active) {
    Serial.printf("SPI: sck=%d miso=%d mosi=%d cs=%d freq=%u mode=%u order=%s dummy=0x%02X\n",
                  spi_.sckPin,
                  spi_.misoPin,
                  spi_.mosiPin,
                  spi_.csPin,
                  spi_.freqHz,
                  spi_.mode,
                  spi_.bitOrder == MSBFIRST ? "msb" : "lsb",
                  spi_.dummyByte);
  } else {
    Serial.println("SPI: inactive");
  }
}

