janhavelka/ESP32_Interfaces/lib/RuntimeProbe/src/RuntimeProbe.cpp
void RuntimeProbe::printPins() const {
  Serial.println("Pin rules: negative pins are rejected; 0..48 typical for ESP32-S2/S3.");
  Serial.println("Pins outside 0..48 are accepted with a warning.");
  Serial.println("Claimed pins:");
  pins_.printClaims();
}

bool RuntimeProbe::parseSeqBits(const char *input, char *err, size_t errLen) {
  if (!input || !*input) {
    snprintf(err, errLen, "missing sequence");
    return false;
  }

  const char *p = input;
  if (p[0] == '0' && (p[1] == 'x' || p[1] == 'X')) {
    p += 2;
  }

  bool bitsOnly = true;
  bool hexOnly = true;
  for (const char *c = p; *c; ++c) {
    if (*c == '_' || isspace(static_cast<unsigned char>(*c))) {
      continue;
    }
    if (*c != '0' && *c != '1') {
      bitsOnly = false;
    }
    if (!isxdigit(static_cast<unsigned char>(*c))) {
      hexOnly = false;
    }
  }

  if (!bitsOnly && !hexOnly) {
    snprintf(err, errLen, "sequence must be bits or hex");
    return false;
  }

  uint8_t bits[JtagState::kMaxSeq * 2];
  size_t bitCount = 0;
  if (bitsOnly) {
    for (const char *c = p; *c; ++c) {
      if (*c == '_' || isspace(static_cast<unsigned char>(*c))) {
        continue;
      }
      if (bitCount >= sizeof(bits)) {
        snprintf(err, errLen, "sequence too long");
        return false;
      }
      bits[bitCount++] = (*c == '1') ? 1 : 0;
    }
  } else {
    for (const char *c = p; *c; ++c) {
      if (*c == '_' || isspace(static_cast<unsigned char>(*c))) {
        continue;
      }
      int value = 0;
      if (*c >= '0' && *c <= '9') {
        value = *c - '0';
      } else if (*c >= 'a' && *c <= 'f') {
        value = *c - 'a' + 10;
      } else if (*c >= 'A' && *c <= 'F') {
        value = *c - 'A' + 10;
      } else {
        snprintf(err, errLen, "invalid hex digit");
        return false;
      }
      for (int bit = 3; bit >= 0; --bit) {
        if (bitCount >= sizeof(bits)) {
          snprintf(err, errLen, "sequence too long");
          return false;
        }
        bits[bitCount++] = (value >> bit) & 0x01;
      }
    }
  }

  if (bitCount < 2 || (bitCount % 2) != 0) {
    snprintf(err, errLen, "sequence needs even number of bits (TMS/TDI pairs)");
    return false;
  }

  size_t steps = bitCount / 2;
  if (steps > JtagState::kMaxSeq) {
    snprintf(err, errLen, "sequence too long (max %u steps)", static_cast<unsigned>(JtagState::kMaxSeq));
    return false;
  }

  jtag_.seqLen = steps;
  for (size_t i = 0; i < steps; ++i) {
    jtag_.tmsSeq[i] = bits[i * 2];
    jtag_.tdiSeq[i] = bits[i * 2 + 1];
  }
  jtag_.seqIndex = 0;
  if (jtag_.active) {
    jtagApplySeq();
  }
  return true;
}

bool RuntimeProbe::handleCommand(int argc, char *argv[], char *err, size_t errLen) {
  if (argc == 0) {
    return true;
  }

  if (strcmp(argv[0], "help") == 0) {
    printHelp();
    return true;
  }
  if (strcmp(argv[0], "status") == 0) {
    printStatus();
    return true;
  }
  if (strcmp(argv[0], "pins") == 0) {
    printPins();
    return true;
  }

  if (strcmp(argv[0], "mode") == 0) {
    if (argc < 2) {
      snprintf(err, errLen, "mode requires an argument");
      return false;
    }
    if (strcmp(argv[1], "off") == 0) {
      stopAllModes();
      mode_ = Mode::Off;
      return true;
    }
    if (strcmp(argv[1], "gpio") == 0) {
      stopAllModes();
      mode_ = Mode::Gpio;
      return true;
    }
    if (strcmp(argv[1], "uart") == 0) {
      stopAllModes();
      mode_ = Mode::Uart;
      return true;
    }
    if (strcmp(argv[1], "jtag") == 0) {
      stopAllModes();
      mode_ = Mode::Jtag;
      return true;
    }
    if (strcmp(argv[1], "spi") == 0) {
      stopAllModes();
      mode_ = Mode::Spi;
      return true;
    }
    if (strcmp(argv[1], "i2c") == 0) {
      stopAllModes();
      mode_ = Mode::I2c;
      return true;
    }
    if (strcmp(argv[1], "pwm") == 0) {
      stopAllModes();
      mode_ = Mode::Pwm;
      return true;
    }
    snprintf(err, errLen, "unknown mode");
    return false;
  }

  if (strcmp(argv[0], "gpio") == 0) {
    if (mode_ != Mode::Gpio) {
      snprintf(err, errLen, "not in gpio mode");
      return false;
    }
    if (argc < 2) {
      snprintf(err, errLen, "gpio requires subcommand");
      return false;
    }
    if (strcmp(argv[1], "set") == 0) {
      if (argc < 3) {
        snprintf(err, errLen, "gpio set <pin>");
        return false;
      }
      int pin = -1;
      if (!parseInt(argv[2], &pin)) {
        snprintf(err, errLen, "invalid pin");
        return false;
      }
      if (!validatePin(pin, err, errLen)) {
        return false;
      }
      if (gpio_.pinClaimed) {
        gpioReleasePin();
      }
      if (!pins_.claim(pin, "GPIO", err, errLen)) {
        return false;
      }
      gpio_.pin = pin;
      gpio_.pinClaimed = true;
      gpio_.wave = GpioState::None;
      pinMode(pin, INPUT);
      return true;
    }
    if (strcmp(argv[1], "toggle") == 0) {
      if (argc < 3) {
        snprintf(err, errLen, "gpio toggle <freq_hz>");
        return false;
      }
      uint32_t freq = 0;
      if (!parseUint32(argv[2], &freq) || freq == 0) {
        snprintf(err, errLen, "invalid frequency");
        return false;
      }
      if (!gpioEnsureClaimed(err, errLen)) {
        return false;
      }
      uint32_t period = 1000000UL / freq;
      if (period < 2) {
        snprintf(err, errLen, "frequency too high for software toggle");
        return false;
      }
      gpio_.halfPeriodUs = period / 2;
      if (gpio_.halfPeriodUs == 0) {
        gpio_.halfPeriodUs = 1;
      }
      pinMode(gpio_.pin, OUTPUT);
      gpio_.level = false;
      digitalWrite(gpio_.pin, LOW);
      gpio_.nextEdgeUs = micros() + gpio_.halfPeriodUs;
      gpio_.wave = GpioState::Toggle;
      return true;
    }
    if (strcmp(argv[1], "pulse") == 0) {
      if (argc < 4) {
        snprintf(err, errLen, "gpio pulse <width_us> <period_us>");
        return false;
      }
      uint32_t width = 0;
      uint32_t period = 0;
      if (!parseUint32(argv[2], &width) || !parseUint32(argv[3], &period)) {
        snprintf(err, errLen, "invalid pulse parameters");
        return false;
      }
      if (width == 0 || period == 0 || width >= period) {
        snprintf(err, errLen, "width must be < period");
        return false;
      }
      if (!gpioEnsureClaimed(err, errLen)) {
        return false;
      }
      gpio_.pulseWidthUs = width;
      gpio_.pulsePeriodUs = period;
      pinMode(gpio_.pin, OUTPUT);
      gpio_.level = true;
      digitalWrite(gpio_.pin, HIGH);
      gpio_.nextEdgeUs = micros() + gpio_.pulseWidthUs;
      gpio_.wave = GpioState::Pulse;
      return true;
    }
    if (strcmp(argv[1], "high") == 0 || strcmp(argv[1], "low") == 0) {
      if (!gpioEnsureClaimed(err, errLen)) {
        return false;
      }
      pinMode(gpio_.pin, OUTPUT);
      gpio_.level = (strcmp(argv[1], "high") == 0);
      digitalWrite(gpio_.pin, gpio_.level ? HIGH : LOW);
      gpio_.wave = GpioState::Static;
      return true;
    }
    if (strcmp(argv[1], "safe") == 0) {
      if (argc < 3) {
        snprintf(err, errLen, "gpio safe <0|1|input>");
        return false;
      }
      if (strcmp(argv[2], "input") == 0) {
        gpio_.safe = GpioState::SafeInput;
        return true;
      }
      if (strcmp(argv[2], "0") == 0) {
        gpio_.safe = GpioState::SafeLow;
        return true;
      }
      if (strcmp(argv[2], "1") == 0) {
        gpio_.safe = GpioState::SafeHigh;
        return true;
      }
      snprintf(err, errLen, "gpio safe expects 0, 1, or input");
      return false;
    }
    if (strcmp(argv[1], "stop") == 0) {
      gpioReleasePin();
      return true;
    }
    snprintf(err, errLen, "unknown gpio subcommand");
    return false;
  }

  if (strcmp(argv[0], "uart") == 0) {
    if (mode_ != Mode::Uart) {
      snprintf(err, errLen, "not in uart mode");
      return false;
    }
    if (argc < 2) {
      snprintf(err, errLen, "uart requires subcommand");
      return false;
    }
    if (strcmp(argv[1], "force") == 0) {
      if (argc < 3) {
        snprintf(err, errLen, "uart force <0|1>");
        return false;
      }
      int val = 0;
      if (!parseInt(argv[2], &val)) {
        snprintf(err, errLen, "invalid force value");
        return false;
      }
      uart_.forceUart0 = (val != 0);
      return true;
    }
    if (strcmp(argv[1], "start") == 0) {
      if (argc < 6) {
        snprintf(err, errLen, "uart start <num> <tx_pin> <rx_pin> <baud>");
        return false;
      }
      int num = 0;
      int txPin = 0;
      int rxPin = 0;
      uint32_t baud = 0;
      if (!parseInt(argv[2], &num) || !parseInt(argv[3], &txPin) ||
          !parseInt(argv[4], &rxPin) || !parseUint32(argv[5], &baud)) {
        snprintf(err, errLen, "invalid uart parameters");
        return false;
      }
      if (num < 0 || num > 2) {
        snprintf(err, errLen, "uart num must be 0, 1, or 2");
        return false;
      }
      if (num == 0 && !uart_.forceUart0) {
        snprintf(err, errLen, "uart0 requires 'uart force 1'");
        return false;
      }
      if (txPin == rxPin) {
        snprintf(err, errLen, "tx and rx pins must differ");
        return false;
      }
      if (baud == 0) {
        snprintf(err, errLen, "baud must be > 0");
        return false;
      }
      if (!validatePin(txPin, err, errLen) || !validatePin(rxPin, err, errLen)) {
        return false;
      }
      HardwareSerial *port = uartByNum(static_cast<uint8_t>(num));
      if (!port) {
        snprintf(err, errLen, "uart num not available");
        return false;
      }
      uartStop();
      if (!pins_.claim(txPin, "UART TX", err, errLen)) {
        return false;
      }
      if (!pins_.claim(rxPin, "UART RX", err, errLen)) {
        pins_.release(txPin, true);
        return false;
      }
      if (num == 0) {
        Serial.println("WARN: UART0 may conflict with Serial monitor.");
      }
      port->begin(baud, SERIAL_8N1, rxPin, txPin);
      uart_.active = true;
      uart_.num = static_cast<uint8_t>(num);
      uart_.txPin = txPin;
      uart_.rxPin = rxPin;
      uart_.baud = baud;
      uart_.port = port;
      uart_.rampValue = 0;
      uart_.asciiIndex = 0;
      uart_.txBudget = 0;
      uart_.lastMicros = micros();
      uart_.rxCount = 0;
      uart_.lastRxReportMs = millis();
      return true;
    }
    if (strcmp(argv[1], "pattern") == 0) {
      if (argc < 3) {
        snprintf(err, errLen, "uart pattern 55|aa|ramp|ascii");
        return false;
      }
      if (strcmp(argv[2], "55") == 0) {
        uart_.pattern = UartState::Pat55;
        return true;
      }
      if (strcmp(argv[2], "aa") == 0) {
        uart_.pattern = UartState::PatAA;
        return true;
      }
      if (strcmp(argv[2], "ramp") == 0) {
        uart_.pattern = UartState::PatRamp;
        uart_.rampValue = 0;
        return true;
      }
      if (strcmp(argv[2], "ascii") == 0) {
        uart_.pattern = UartState::PatAscii;
        uart_.asciiIndex = 0;
        return true;
      }
      snprintf(err, errLen, "unknown uart pattern");
      return false;
    }
    if (strcmp(argv[1], "txrate") == 0) {
      if (argc < 3) {
        snprintf(err, errLen, "uart txrate <bytes_per_sec>");
        return false;
      }
      uint32_t rate = 0;
      if (!parseUint32(argv[2], &rate)) {
        snprintf(err, errLen, "invalid txrate");
        return false;
      }
      uart_.txRateBps = rate;
      uart_.txBudget = 0;
      uart_.lastMicros = micros();
      return true;
    }
    if (strcmp(argv[1], "echo") == 0) {
      if (argc < 3) {
        snprintf(err, errLen, "uart echo <0|1>");
        return false;
      }
      int val = 0;
      if (!parseInt(argv[2], &val)) {
        snprintf(err, errLen, "invalid echo value");
        return false;
      }
      uart_.echo = (val != 0);
      return true;
    }
    if (strcmp(argv[1], "stop") == 0) {
      uartStop();
      return true;
    }
    snprintf(err, errLen, "unknown uart subcommand");
    return false;
  }

  if (strcmp(argv[0], "jtag") == 0) {
    if (mode_ != Mode::Jtag) {
      snprintf(err, errLen, "not in jtag mode");
      return false;
    }
    if (argc < 2) {
      snprintf(err, errLen, "jtag requires subcommand");
      return false;
    }
    if (strcmp(argv[1], "bitbang") == 0) {
      if (argc < 6) {
        snprintf(err, errLen, "jtag bitbang <tck> <tms> <tdi> [tdo] <freq_hz>");
        return false;
      }
      int tck = -1, tms = -1, tdi = -1, tdo = -1;
      uint32_t freq = 0;
      if (argc == 6) {
        if (!parseInt(argv[2], &tck) || !parseInt(argv[3], &tms) ||
            !parseInt(argv[4], &tdi) || !parseUint32(argv[5], &freq)) {
          snprintf(err, errLen, "invalid jtag parameters");
          return false;
        }
      } else {
        if (!parseInt(argv[2], &tck) || !parseInt(argv[3], &tms) ||
            !parseInt(argv[4], &tdi) || !parseInt(argv[5], &tdo) ||
            !parseUint32(argv[6], &freq)) {
          snprintf(err, errLen, "invalid jtag parameters");
          return false;
        }
      }
      if (!validatePin(tck, err, errLen) || !validatePin(tms, err, errLen) ||
          !validatePin(tdi, err, errLen)) {
        return false;
      }
      if (tdo >= 0 && !validatePin(tdo, err, errLen)) {
        return false;
      }
      if (freq == 0) {
        snprintf(err, errLen, "invalid frequency");
        return false;
      }
      uint32_t period = 1000000UL / freq;
      if (period < 2) {
        snprintf(err, errLen, "frequency too high for software bitbang");
        return false;
      }
      jtagStop();
      if (!pins_.claim(tck, "JTAG TCK", err, errLen)) {
        return false;
      }
      if (!pins_.claim(tms, "JTAG TMS", err, errLen)) {
        pins_.release(tck, true);
        return false;
      }
      if (!pins_.claim(tdi, "JTAG TDI", err, errLen)) {
        pins_.release(tck, true);
        pins_.release(tms, true);
        return false;
      }
      if (tdo >= 0) {
        if (!pins_.claim(tdo, "JTAG TDO", err, errLen)) {
          pins_.release(tck, true);
          pins_.release(tms, true);
          pins_.release(tdi, true);
          return false;
        }
      }
      jtag_.tckPin = tck;
      jtag_.tmsPin = tms;
      jtag_.tdiPin = tdi;
      jtag_.tdoPin = tdo;
      jtag_.freqHz = freq;
      jtag_.halfPeriodUs = period / 2;
      if (jtag_.halfPeriodUs == 0) {
        jtag_.halfPeriodUs = 1;
      }
      pinMode(tck, OUTPUT);
      pinMode(tms, OUTPUT);
      pinMode(tdi, OUTPUT);
      if (tdo >= 0) {
        pinMode(tdo, INPUT);
      }
      digitalWrite(tck, LOW);
      jtag_.tckHigh = false;
      jtag_.seqIndex = 0;
      if (jtag_.seqLen == 0) {
        jtagSetDefaultSeq();
      }
      jtagApplySeq();
      jtag_.nextEdgeUs = micros() + jtag_.halfPeriodUs;
      jtag_.tdoShift = 0;
      jtag_.tdoCount = 0;
      jtag_.active = true;
      return true;
    }
    if (strcmp(argv[1], "seq") == 0) {
      if (argc < 3) {
        snprintf(err, errLen, "jtag seq <bits_or_hex>");
        return false;
      }
      if (!parseSeqBits(argv[2], err, errLen)) {
        return false;
      }
      return true;
    }
    if (strcmp(argv[1], "stop") == 0) {
      jtagStop();
      return true;
    }
    snprintf(err, errLen, "unknown jtag subcommand");
    return false;
  }

