janhavelka/ESP32_Interfaces/lib/RuntimeProbe/src/RuntimeProbe.cpp
  if (strcmp(argv[0], "i2c") == 0) {
    if (mode_ != Mode::I2c) {
      snprintf(err, errLen, "not in i2c mode");
      return false;
    }
    if (argc < 2) {
      snprintf(err, errLen, "i2c requires subcommand");
      return false;
    }
    if (strcmp(argv[1], "start") == 0) {
      if (argc < 4) {
        snprintf(err, errLen, "i2c start <sda> <scl> [freq_hz] [timeout_ms]");
        return false;
      }
      int sda = -1;
      int scl = -1;
      if (!parseInt(argv[2], &sda) || !parseInt(argv[3], &scl)) {
        snprintf(err, errLen, "invalid i2c pins");
        return false;
      }
      uint32_t freq = i2c_.freqHz;
      uint32_t timeout = i2c_.timeoutMs;
      if (argc >= 5 && !parseUint32(argv[4], &freq)) {
        snprintf(err, errLen, "invalid i2c frequency");
        return false;
      }
      if (argc >= 6 && !parseUint32(argv[5], &timeout)) {
        snprintf(err, errLen, "invalid i2c timeout");
        return false;
      }
      if (freq == 0 || timeout == 0) {
        snprintf(err, errLen, "i2c freq/timeout must be > 0");
        return false;
      }
      if (!validatePin(sda, err, errLen) || !validatePin(scl, err, errLen)) {
        return false;
      }
      i2cStop();
      if (!pins_.claim(sda, "I2C SDA", err, errLen)) {
        return false;
      }
      if (!pins_.claim(scl, "I2C SCL", err, errLen)) {
        pins_.release(sda, true);
        return false;
      }
      Wire.begin(sda, scl, freq);
      Wire.setClock(freq);
      Wire.setTimeOut(timeout);
      i2c_.active = true;
      i2c_.sdaPin = sda;
      i2c_.sclPin = scl;
      i2c_.freqHz = freq;
      i2c_.timeoutMs = timeout;
      i2c_.scanActive = false;
      return true;
    }
    if (strcmp(argv[1], "freq") == 0) {
      if (argc < 3) {
        snprintf(err, errLen, "i2c freq <hz>");
        return false;
      }
      if (!i2c_.active) {
        snprintf(err, errLen, "i2c not started");
        return false;
      }
      uint32_t freq = 0;
      if (!parseUint32(argv[2], &freq) || freq == 0) {
        snprintf(err, errLen, "invalid i2c frequency");
        return false;
      }
      Wire.setClock(freq);
      i2c_.freqHz = freq;
      return true;
    }
    if (strcmp(argv[1], "timeout") == 0) {
      if (argc < 3) {
        snprintf(err, errLen, "i2c timeout <ms>");
        return false;
      }
      if (!i2c_.active) {
        snprintf(err, errLen, "i2c not started");
        return false;
      }
      uint32_t timeout = 0;
      if (!parseUint32(argv[2], &timeout) || timeout == 0) {
        snprintf(err, errLen, "invalid i2c timeout");
        return false;
      }
      Wire.setTimeOut(timeout);
      i2c_.timeoutMs = timeout;
      return true;
    }
    if (strcmp(argv[1], "scan") == 0) {
      if (!i2c_.active) {
        snprintf(err, errLen, "i2c not started");
        return false;
      }
      if (argc >= 3 && strcmp(argv[2], "stop") == 0) {
        i2c_.scanActive = false;
        return true;
      }
      uint8_t start = 0x03;
      uint8_t end = 0x77;
      if (argc >= 3) {
        if (!parseI2cAddress(argv[2], &start, err, errLen)) {
          return false;
        }
        end = start;
      }
      if (argc >= 4) {
        if (!parseI2cAddress(argv[3], &end, err, errLen)) {
          return false;
        }
      }
      if (start > end) {
        snprintf(err, errLen, "scan start must be <= end");
        return false;
      }
      i2c_.scanStart = start;
      i2c_.scanEnd = end;
      i2c_.scanAddr = start;
      i2c_.scanFound = 0;
      i2c_.scanActive = true;
      i2c_.scanNextMs = millis();
      Serial.printf("I2C scan 0x%02X-0x%02X\n", start, end);
      return true;
    }
    if (strcmp(argv[1], "write") == 0) {
      if (argc < 4) {
        snprintf(err, errLen, "i2c write <addr> <byte...>");
        return false;
      }
      if (!i2c_.active) {
        snprintf(err, errLen, "i2c not started");
        return false;
      }
      uint8_t addr = 0;
      if (!parseI2cAddress(argv[2], &addr, err, errLen)) {
        return false;
      }
      uint8_t data[kMaxIoBytes];
      size_t count = 0;
      for (int i = 3; i < argc; ++i) {
        if (count >= kMaxIoBytes) {
          snprintf(err, errLen, "too many bytes (max %u)", static_cast<unsigned>(kMaxIoBytes));
          return false;
        }
        if (!parseByte(argv[i], &data[count], err, errLen)) {
          return false;
        }
        count++;
      }
      if (count == 0) {
        snprintf(err, errLen, "no data bytes");
        return false;
      }
      Wire.beginTransmission(addr);
      Wire.write(data, count);
      uint8_t rc = Wire.endTransmission();
      if (rc != 0) {
        const char *msg = (rc == 1) ? "data too long"
                          : (rc == 2) ? "address nack"
                          : (rc == 3) ? "data nack"
                          : (rc == 4) ? "bus error"
                                      : "unknown error";
        snprintf(err, errLen, "i2c write failed (%s)", msg);
        return false;
      }
      return true;
    }
    if (strcmp(argv[1], "read") == 0) {
      if (argc < 4) {
        snprintf(err, errLen, "i2c read <addr> <len>");
        return false;
      }
      if (!i2c_.active) {
        snprintf(err, errLen, "i2c not started");
        return false;
      }
      uint8_t addr = 0;
      if (!parseI2cAddress(argv[2], &addr, err, errLen)) {
        return false;
      }
      uint32_t len = 0;
      if (!parseUint32(argv[3], &len) || len == 0 || len > kMaxIoBytes) {
        snprintf(err, errLen, "read length 1..%u", static_cast<unsigned>(kMaxIoBytes));
        return false;
      }
      uint8_t data[kMaxIoBytes];
      size_t got = Wire.requestFrom(static_cast<int>(addr), static_cast<int>(len));
      if (got == 0) {
        snprintf(err, errLen, "i2c read failed");
        return false;
      }
      for (size_t i = 0; i < got; ++i) {
        if (Wire.available()) {
          data[i] = static_cast<uint8_t>(Wire.read());
        } else {
          data[i] = 0;
        }
      }
      printHexLine("I2C RX:", data, got);
      if (got != len) {
        Serial.printf("WARN: requested %u, got %u\n", static_cast<unsigned>(len), static_cast<unsigned>(got));
      }
      return true;
    }
    if (strcmp(argv[1], "writeread") == 0) {
      if (argc < 5) {
        snprintf(err, errLen, "i2c writeread <addr> <len> <byte...>");
        return false;
      }
      if (!i2c_.active) {
        snprintf(err, errLen, "i2c not started");
        return false;
      }
      uint8_t addr = 0;
      if (!parseI2cAddress(argv[2], &addr, err, errLen)) {
        return false;
      }
      uint32_t len = 0;
      if (!parseUint32(argv[3], &len) || len == 0 || len > kMaxIoBytes) {
        snprintf(err, errLen, "read length 1..%u", static_cast<unsigned>(kMaxIoBytes));
        return false;
      }
      uint8_t data[kMaxIoBytes];
      size_t count = 0;
      for (int i = 4; i < argc; ++i) {
        if (count >= kMaxIoBytes) {
          snprintf(err, errLen, "too many bytes (max %u)", static_cast<unsigned>(kMaxIoBytes));
          return false;
        }
        if (!parseByte(argv[i], &data[count], err, errLen)) {
          return false;
        }
        count++;
      }
      if (count == 0) {
        snprintf(err, errLen, "no data bytes");
        return false;
      }
      Wire.beginTransmission(addr);
      Wire.write(data, count);
      uint8_t rc = Wire.endTransmission(false);
      if (rc != 0) {
        const char *msg = (rc == 1) ? "data too long"
                          : (rc == 2) ? "address nack"
                          : (rc == 3) ? "data nack"
                          : (rc == 4) ? "bus error"
                                      : "unknown error";
        snprintf(err, errLen, "i2c write failed (%s)", msg);
        return false;
      }
      uint8_t rx[kMaxIoBytes];
      size_t got = Wire.requestFrom(static_cast<int>(addr), static_cast<int>(len));
      if (got == 0) {
        snprintf(err, errLen, "i2c read failed");
        return false;
      }
      for (size_t i = 0; i < got; ++i) {
        if (Wire.available()) {
          rx[i] = static_cast<uint8_t>(Wire.read());
        } else {
          rx[i] = 0;
        }
      }
      printHexLine("I2C RX:", rx, got);
      if (got != len) {
        Serial.printf("WARN: requested %u, got %u\n", static_cast<unsigned>(len), static_cast<unsigned>(got));
      }
      return true;
    }
    if (strcmp(argv[1], "stop") == 0) {
      i2cStop();
      return true;
    }
    snprintf(err, errLen, "unknown i2c subcommand");
    return false;
  }

  if (strcmp(argv[0], "spi") == 0) {
    if (mode_ != Mode::Spi) {
      snprintf(err, errLen, "not in spi mode");
      return false;
    }
    if (argc < 2) {
      snprintf(err, errLen, "spi requires subcommand");
      return false;
    }
    if (strcmp(argv[1], "start") == 0) {
      if (argc < 5) {
        snprintf(err, errLen, "spi start <sck> <miso> <mosi> [cs]");
        return false;
      }
      int sck = -1;
      int miso = -1;
      int mosi = -1;
      int cs = -1;
      if (!parseInt(argv[2], &sck) || !parseInt(argv[3], &miso) || !parseInt(argv[4], &mosi)) {
        snprintf(err, errLen, "invalid spi pins");
        return false;
      }
      if (argc >= 6 && !parseInt(argv[5], &cs)) {
        snprintf(err, errLen, "invalid cs pin");
        return false;
      }
      if (!validatePin(sck, err, errLen) || !validatePin(miso, err, errLen) ||
          !validatePin(mosi, err, errLen)) {
        return false;
      }
      if (cs >= 0 && !validatePin(cs, err, errLen)) {
        return false;
      }
      spiStop();
      if (!pins_.claim(sck, "SPI SCK", err, errLen)) {
        return false;
      }
      if (!pins_.claim(miso, "SPI MISO", err, errLen)) {
        pins_.release(sck, true);
        return false;
      }
      if (!pins_.claim(mosi, "SPI MOSI", err, errLen)) {
        pins_.release(sck, true);
        pins_.release(miso, true);
        return false;
      }
      if (cs >= 0) {
        if (!pins_.claim(cs, "SPI CS", err, errLen)) {
          pins_.release(sck, true);
          pins_.release(miso, true);
          pins_.release(mosi, true);
          return false;
        }
      }
      SPI.begin(sck, miso, mosi, (cs >= 0) ? cs : -1);
      if (cs >= 0) {
        pinMode(cs, OUTPUT);
        digitalWrite(cs, HIGH);
      }
      spi_.active = true;
      spi_.sckPin = sck;
      spi_.misoPin = miso;
      spi_.mosiPin = mosi;
      spi_.csPin = (cs >= 0) ? cs : -1;
      return true;
    }
    if (strcmp(argv[1], "freq") == 0) {
      if (argc < 3) {
        snprintf(err, errLen, "spi freq <hz>");
        return false;
      }
      if (!spi_.active) {
        snprintf(err, errLen, "spi not started");
        return false;
      }
      uint32_t freq = 0;
      if (!parseUint32(argv[2], &freq) || freq == 0) {
        snprintf(err, errLen, "invalid spi frequency");
        return false;
      }
      spi_.freqHz = freq;
      return true;
    }
    if (strcmp(argv[1], "mode") == 0) {
      if (argc < 3) {
        snprintf(err, errLen, "spi mode <0|1|2|3>");
        return false;
      }
      if (!spi_.active) {
        snprintf(err, errLen, "spi not started");
        return false;
      }
      int mode = 0;
      if (!parseInt(argv[2], &mode) || mode < 0 || mode > 3) {
        snprintf(err, errLen, "spi mode must be 0..3");
        return false;
      }
      spi_.mode = static_cast<uint8_t>(mode);
      return true;
    }
    if (strcmp(argv[1], "order") == 0) {
      if (argc < 3) {
        snprintf(err, errLen, "spi order msb|lsb");
        return false;
      }
      if (!spi_.active) {
        snprintf(err, errLen, "spi not started");
        return false;
      }
      if (strcmp(argv[2], "msb") == 0) {
        spi_.bitOrder = MSBFIRST;
        return true;
      }
      if (strcmp(argv[2], "lsb") == 0) {
        spi_.bitOrder = LSBFIRST;
        return true;
      }
      snprintf(err, errLen, "spi order must be msb or lsb");
      return false;
    }
    if (strcmp(argv[1], "cs") == 0) {
      if (argc < 3) {
        snprintf(err, errLen, "spi cs <pin|-1>");
        return false;
      }
      if (!spi_.active) {
        snprintf(err, errLen, "spi not started");
        return false;
      }
      int cs = -1;
      if (!parseInt(argv[2], &cs)) {
        snprintf(err, errLen, "invalid cs pin");
        return false;
      }
      if (cs >= 0 && !validatePin(cs, err, errLen)) {
        return false;
      }
      if (spi_.csPin >= 0) {
        pins_.release(spi_.csPin, true);
      }
      spi_.csPin = -1;
      if (cs >= 0) {
        if (!pins_.claim(cs, "SPI CS", err, errLen)) {
          return false;
        }
        pinMode(cs, OUTPUT);
        digitalWrite(cs, HIGH);
        spi_.csPin = cs;
      }
      return true;
    }
    if (strcmp(argv[1], "dummy") == 0) {
      if (argc < 3) {
        snprintf(err, errLen, "spi dummy <byte>");
        return false;
      }
      if (!spi_.active) {
        snprintf(err, errLen, "spi not started");
        return false;
      }
      uint8_t val = 0;
      if (!parseByte(argv[2], &val, err, errLen)) {
        return false;
      }
      spi_.dummyByte = val;
      return true;
    }
    if (strcmp(argv[1], "xfer") == 0) {
      if (argc < 3) {
        snprintf(err, errLen, "spi xfer <byte...>");
        return false;
      }
      if (!spi_.active) {
        snprintf(err, errLen, "spi not started");
        return false;
      }
      uint8_t tx[kMaxIoBytes];
      uint8_t rx[kMaxIoBytes];
      size_t count = 0;
      for (int i = 2; i < argc; ++i) {
        if (count >= kMaxIoBytes) {
          snprintf(err, errLen, "too many bytes (max %u)", static_cast<unsigned>(kMaxIoBytes));
          return false;
        }
        if (!parseByte(argv[i], &tx[count], err, errLen)) {
          return false;
        }
        count++;
      }
      if (count == 0) {
        snprintf(err, errLen, "no data bytes");
        return false;
      }
      SPI.beginTransaction(SPISettings(spi_.freqHz, spi_.bitOrder, spi_.mode));
      if (spi_.csPin >= 0) {
        digitalWrite(spi_.csPin, LOW);
      }
      for (size_t i = 0; i < count; ++i) {
        rx[i] = SPI.transfer(tx[i]);
      }
      if (spi_.csPin >= 0) {
        digitalWrite(spi_.csPin, HIGH);
      }
      SPI.endTransaction();
      printHexLine("SPI RX:", rx, count);
      return true;
    }
    if (strcmp(argv[1], "read") == 0) {
      if (argc < 3) {
        snprintf(err, errLen, "spi read <len>");
        return false;
      }
      if (!spi_.active) {
        snprintf(err, errLen, "spi not started");
        return false;
      }
      uint32_t len = 0;
      if (!parseUint32(argv[2], &len) || len == 0 || len > kMaxIoBytes) {
        snprintf(err, errLen, "read length 1..%u", static_cast<unsigned>(kMaxIoBytes));
        return false;
      }
      uint8_t rx[kMaxIoBytes];
      SPI.beginTransaction(SPISettings(spi_.freqHz, spi_.bitOrder, spi_.mode));
      if (spi_.csPin >= 0) {
        digitalWrite(spi_.csPin, LOW);
      }
      for (size_t i = 0; i < len; ++i) {
        rx[i] = SPI.transfer(spi_.dummyByte);
      }
      if (spi_.csPin >= 0) {
        digitalWrite(spi_.csPin, HIGH);
      }
      SPI.endTransaction();
      printHexLine("SPI RX:", rx, len);
      return true;
    }
    if (strcmp(argv[1], "stop") == 0) {
      spiStop();
      return true;
    }
    snprintf(err, errLen, "unknown spi subcommand");
    return false;
  }

  snprintf(err, errLen, "unknown command");
  return false;
}

void RuntimeProbe::handleConsole() {
  while (Serial.available()) {
    const char c = static_cast<char>(Serial.read());
    if (c == '\r' || c == '\n') {
      if (lineLen_ == 0) {
        continue;
      }
      lineBuf_[lineLen_] = '\0';
      char *argv[24];
      int argc = tokenize(lineBuf_, argv, 24);
      if (argc == 0) {
        lineLen_ = 0;
        continue;
      }
      char err[96] = {0};
      if (handleCommand(argc, argv, err, sizeof(err))) {
        Serial.println("OK");
      } else {
        Serial.print("ERR: ");
        Serial.println(err[0] ? err : "unknown");
      }
      lineLen_ = 0;
    } else if (c == '\b' || c == 0x7F) {
      if (lineLen_ > 0) {
        lineLen_--;
      }
    } else if (isprint(static_cast<unsigned char>(c))) {
      if (lineLen_ < sizeof(lineBuf_) - 1) {
        lineBuf_[lineLen_++] = c;
      }
    }
  }
}

void RuntimeProbe::begin() {
  Serial.begin(kSerialBaud);
  jtagSetDefaultSeq();

  Serial.println();
  Serial.println("ESP32 Runtime Interface & GPIO Probe");
  Serial.printf("Chip: %s rev %d\n", ESP.getChipModel(), ESP.getChipRevision());
  Serial.printf("Build: %s %s\n", __DATE__, __TIME__);
  Serial.println("Type 'help' for commands.");
  Serial.println("Examples:");
  Serial.println("  mode gpio");
  Serial.println("  gpio set 5");
  Serial.println("  gpio toggle 100000");
  Serial.println("  gpio pulse 5 20");
  Serial.println("  mode uart");
  Serial.println("  uart start 1 17 18 921600");
  Serial.println("  uart pattern 55");
  Serial.println("  mode jtag");
  Serial.println("  jtag bitbang 39 40 41 42 10000");
  Serial.println("  mode i2c");
  Serial.println("  i2c start 8 9 400000");
  Serial.println("  i2c scan");
  Serial.println("  mode spi");
  Serial.println("  spi start 18 19 23 5");
  Serial.println("  spi xfer 0x9F");
}

void RuntimeProbe::update() {
  handleConsole();
  gpioUpdate();
  uartUpdate();
  jtagUpdate();
  i2cUpdate();
}
